In [1]:
print ("Om Mahaa Ganapataye Namah")

Om Mahaa Ganapataye Namah

In [2]:
import numpy as np
import pandas as pd

In [7]:
train= pd.read_csv("D:/dat6/ex1.csv",sep=',')
# train.head()
train

,custid,Gender,Married,Dependents,edu,Income,LoanAmt,Loan_Amt_Term,Credit_History,prop_area,Loan_status
0,LP001002,Male,Yes,0.0,Graduate,5849.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,No,1.0,Graduate,4583.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0.0,Graduate,3000.0,NaN,360.0,NaN,Urban,Y
3,LP001006,NaN,NaN,0.0,'Not Graduate',2583.0,120.0,360.0,1.0,Urban,Y
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,LP001008,Male,No,0.0,'Graduate',6000.0,141.0,360.0,1.0,Urban,Y

In [6]:
train.isnull().sum()

custid            1
Gender            2
Married           2
Dependents        1
edu               1
Income            1
LoanAmt           3
Loan_Amt_Term     1
Credit_History    2
prop_area         1
Loan_status       1
dtype: int64

In [7]:
train.count()

custid            5
Gender            4
Married           4
Dependents        5
edu               5
Income            5
LoanAmt           3
Loan_Amt_Term     5
Credit_History    4
prop_area         5
Loan_status       5
dtype: int64

In [13]:
(train.isnull().sum()).LoanAmt

3

In [12]:
train.LoanAmt.isnull().sum()

3

In [15]:
train.count().max()

5

In [16]:
train.LoanAmt.count() # unique values

3

In [17]:
train.count().max() - train.LoanAmt.count()

2

In [31]:
train

,custid,Gender,Married,Dependents,edu,Income,LoanAmt,Loan_Amt_Term,Credit_History,prop_area,Loan_status
0,LP001002,Male,No,0,Graduate,5849,NaN,360,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,4583,128.0,360,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,3000,NaN,360,NaN,Urban,Y
3,LP001006,Male,Yes,0,'Not Graduate',2583,120.0,360,1.0,Urban,Y
4,LP001008,Male,No,0,'Graduate',6000,141.0,360,1.0,Urban,Y

In [25]:
pd.isna(train.LoanAmt).sum()

2

In [25]:
train= pd.read_csv("D:/dat6/ex2.csv",sep=',')
train.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_status
0,LP001002,Male,No,0.0,Graduate,5849,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,4583,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,NaN,NaN,3000,NaN,NaN,NaN,NaN,Y
3,LP001006,Male,Yes,0.0,'Not Graduate',2583,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,'Graduate',6000,141.0,360.0,1.0,Urban,Y

In [26]:
train[~train.Credit_History.isnull()]

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_status
0,LP001002,Male,No,0.0,Graduate,5849,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,4583,128.0,360.0,1.0,Rural,N
3,LP001006,Male,Yes,0.0,'Not Graduate',2583,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,'Graduate',6000,141.0,360.0,1.0,Urban,Y

In [16]:
new_df = train[~train.Credit_History.isnull()]

In [44]:
new_df

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_status
0,LP001002,Male,No,0.0,Graduate,5849,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,4583,128.0,360.0,1.0,Rural,N
3,LP001006,Male,Yes,0.0,'Not Graduate',2583,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,'Graduate',6000,141.0,360.0,1.0,Urban,Y

In [8]:
train[train.Credit_History.isna()]

,custid,Gender,Married,Dependents,edu,Income,LoanAmt,Loan_Amt_Term,Credit_History,prop_area,Loan_status
2,LP001005,Male,Yes,0.0,Graduate,3000.0,NaN,360.0,NaN,Urban,Y
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
train

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_status
0,LP001002,Male,No,0.0,Graduate,5849,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,4583,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,NaN,NaN,3000,NaN,NaN,NaN,NaN,Y
3,LP001006,Male,Yes,0.0,'Not Graduate',2583,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,'Graduate',6000,141.0,360.0,1.0,Urban,Y

In [54]:
train.dropna(how='any').shape

(3, 11)

In [44]:
train.dropna(how='any',thresh=6).shape
#train.dropna(how='any')

(4, 11)

In [21]:
#train.shape
train.shape[1]
#train.dropna(axis=0, how='any', thresh=train.shape[1] - 5)

11

In [61]:
train

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_status
0,LP001002,Male,No,0.0,Graduate,5849,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,4583,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,NaN,NaN,3000,NaN,NaN,NaN,NaN,Y
3,LP001006,Male,Yes,0.0,'Not Graduate',2583,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,'Graduate',6000,141.0,360.0,1.0,Urban,Y

In [67]:
train.shape

(5, 11)

In [55]:
train[train.Education == 'Graduate']

train['Education'].isin(train['Education']).value_counts()

True    5
Name: Education, dtype: int64

In [45]:
train.dropna(axis=0,how='all',thresh=5)

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_status
0,LP001002,Male,No,0.0,Graduate,5849,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1.0,Graduate,4583,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,NaN,NaN,3000,NaN,NaN,NaN,NaN,Y
3,LP001006,Male,Yes,0.0,'Not Graduate',2583,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0.0,'Graduate',6000,141.0,360.0,1.0,Urban,Y

In [68]:
train.shape[1]

11

In [69]:
(20/5)*100

400.0

In [70]:
float(train.shape[0])

5.0

In [79]:
train.loc[(train.Gender == 'Male') &  (train.Married == 'Yes') ].shape[0]

3

In [80]:
(3/5)*100

60.0

In [56]:
train= pd.read_csv("D:/dat6/ex4.csv",sep=',')
train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Marital_Status,Product_Category_1,Purchase
0,1000004,P00128942,M,46-50,7,B,0,1,1000004P00128942
1,1000009,P00113442,M,0-17,10,A,0,1,1000009P00113442
2,1000010,P0087842,F,0-17,10,A,0,12,1000009P00288442
3,1000010,P0085442,F,0-17,10,A,0,12,1000009P00145342
4,1000011,P00285442,M,55+,16,C,0,8,1000011P00053842

In [79]:
#train.Age.apply(lambda x : np.array(x.split('-'),dtype=int).mean())
#train['Age'] =
train[train.Age].apply(lambda x : np.array(x.split('-'), dtype=int).mean if x == '0-17')

SyntaxError: invalid syntax (<ipython-input-79-7b6a5f02988e>, line 3)

In [ ]:
set()

In [86]:
df=train.Gender.map({'M':1,'F':0}).astype(int)

In [85]:
df

0    1
1    1
2    0
3    0
4    1
Name: Gender, dtype: int64

In [87]:
df

0    1
1    1
2    0
3    0
4    1
Name: Gender, dtype: int32

In [88]:
train.loc[:,'Gender']=train.Gender.map({'M':1,'F':0}).astype(int)

In [89]:
train

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Marital_Status,Product_Category_1,Purchase
0,1000004,P00128942,1,46-50,7,B,0,1,1000004P00128942
1,1000009,P00113442,1,0-17,10,A,0,1,1000009P00113442
2,1000010,P0087842,0,0-17,10,A,0,12,1000009P00288442
3,1000010,P0085442,0,0-17,10,A,0,12,1000009P00145342
4,1000011,P00285442,1,55+,16,C,0,8,1000011P00053842

In [96]:
# train.iloc[start:end]
train.loc[1:3,['Gender','Age']]

   Gender   Age
1       1  0-17
2       0  0-17
3       0  0-17

In [105]:
# train.iloc[start:end]
train.loc[:,['Gender','Age']]

   Gender    Age
0       1  46-50
1       1   0-17
2       0   0-17
3       0   0-17
4       1    55+

In [99]:
# train.iloc[start:end-1]    0th index position
train.iloc[1:4,[2,3]]

   Gender   Age
1       1  0-17
2       0  0-17
3       0  0-17

In [ ]:
try:
except:
else:
finally:

In [106]:
df = open('marks.csv')

FileNotFoundError: [Errno 2] No such file or directory: 'marks.csv'

In [107]:
try:
    df = open('marks.csv')
except:
    print('Unfortunately this file doesnt exists, please specify the correct file name or path')

Unfortunately this file doesnt exists, please specify the correct file name or path

In [108]:
x=20
y=10
res = x/y
print (res)

2.0

In [110]:
x=20
y=0
res = x/y
print (res)
a = 10 
b= 20
print (a+b)

ZeroDivisionError: division by zero

In [154]:
import sys
try:
    x=20
    y=0
    f= open('marks.csv')
    res = x/y    
    
except FileNotFoundError as e:
     print (e)
except:
    print(sys.exc_info())
 
a = 10 
b= 20
print (a+b)

[Errno 2] No such file or directory: 'marks.csv'
30

In [ ]:
x=20
y=0
res = x/y
print (res)

In [143]:
try:
    f= open('D:/dat1/marks.csv')
    x=1/0
except FileNotFoundError:    
    print ('may be the file name is wrong ')
except ZeroDivisionError:
    print ('donot divide by zeor')
finally:
    print ("close the file ")
    f.close()
a = 10 
b= 20
print (a+b)

donot divide by zeor
close the file
30

In [140]:
import os
os.getcwd()

'C:\\Users\\home'

In [1]:
try:
    f= open('D:/dat1/marks.csv')
    x = 10
    y = 0 
    if (y==0):
        raise except1
except except1
    print ('zero dive by erro')
except FileNotFoundError:    
    print ('may be the file name is wrong ')
except ZeroDivisionError:
    print ('donot divide by zeor')
finally:
    print ("close the file ")
    f.close()
a = 10 
b= 20
print (a+b)

SyntaxError: invalid syntax (<ipython-input-1-9e841886f43c>, line 7)

In [6]:
try:
    f= open('D:/dat1/marks.csv')
    x = 10
    y = 0 
    if (y==0):
        raise except1        
except except1
        print ('zero dive by erro')
a = 10 
b= 20
print (a+b)

SyntaxError: invalid syntax (<ipython-input-6-c351b81230c2>, line 7)